Repository: UPCnet/ushare.core
Catalog: src/ushare/core/locales/*/LC_MESSAGES/ushare.portlets.po
Languages: ca, es

source: Extension profile for ushare.portlets.
ca: Perfil d'extensió per a ushare.portlets.
es: Perfil de extensión para ushare.portlets.

source: Go to parent folder
ca: Anar a la carpeta principal
es: Ir a la carpeta principal

source: Info
ca: Informació
es: Información

source: Uninstall profile for ushare.portlets
ca: Desinstal·lar el perfil per a ushare.portlets
es: Desinstalar el perfil para ushare.portlets

# action_convert_legacy_portlets
source: There are legacy portlets defined here. Click the button to convert them to new-style portlets.
ca: Hi ha portlets heretats indicats aquí. Feu clic al botó per convertir-los a portlets d'estil nou.
es: Hay portlets heredados definidos aquí. Haga clic en el botón para convertirlos a portlets de estilo nuevo.

source: add them to the folder itself
ca: afegiu-los a la mateixa carpeta
es: agréguelos a la misma carpeta

source: ushare.portlets (uninstall)
ca: ushare.portlets (desinstal·lar)
es: ushare.portlets (desinstalar)

# description_contenttype_portlets_below
source: Note that content type portlets are normally rendered below context portlets.
ca: Recordeu que els portlets de tipus de contingut normalment es representen sota dels portlets de context.
es: Tenga en cuenta que los portlets de tipo de contenido normalmente se representan debajo de los portlets de contexto.

# description_manage_contenttype_portlets
source: Note that content type portlets are normally rendered below context portlets.
ca: Les ranures del portlet esquerre i dret ara mostraran només els portlets assignats a aquest tipus de contingut. Utilitzeu els enllaços cap amunt, cap avall, eliminar i editar per administrar els portlets d'usuari. Utilitzeu la llista desplegable per afegir nous portlets.
es: Las ranuras del portlet izquierdo y derecho ahora mostrarán solo los portlets asignados a este tipo de contenido. Utilice los enlaces hacia arriba, hacia abajo, eliminar y editar para administrar los portlets de usuario. Use la lista desplegable para agregar nuevos portlets.

# description_manage_contextual_portlets
source: The portlet columns will first display portlets explicitly assigned in this context. Use the buttons on each portlet to move them up or down, delete or edit them. To add a new portlet, use the drop-down list at the top of the column.
ca: Les columnes del portlet primer mostraran els portlets assignats explícitament en aquest context. Utilitza els botons a cada portlet per moure'ls cap amunt o cap avall, eliminar-los o editar-los. Per afegir un portlet nou, feu servir la llista desplegable a la part superior de la columna.
es: Las columnas del portlet primero mostrarán los portlets asignados explícitamente en este contexto. Use los botones en cada portlet para moverlos hacia arriba o hacia abajo, eliminarlos o editarlos. Para agregar un portlet nuevo, use la lista desplegable en la parte superior de la columna.

# description_portlets_block_unblock
source: If you wish to block or unblock certain categories of portlets, you can do so using the drop-down boxes. Portlets that are included by these categories are shown below the selection box.
ca: Si voleu bloquejar o desbloquejar certes categories de portlets, pot fer-ho usant els quadres desplegables. Els portlets que estan inclosos en aquestes categories es mostren sota el quadre de selecció.
es: Si desea bloquear o desbloquear ciertas categorías de portlets, puede hacerlo usando los cuadros desplegables. Los portlets que están incluidos en estas categorías se muestran debajo del cuadro de selección.

# label_convert_portlets
source: Convert portlets
ca: Converteix portlets
es: Convertir portlets

# label_manage_portlets_default_view_container
source: You are managing the portlets of the default view of a container. If you wanted to manage the portlets of the container itself, ${go_here}.
ca: Està administrant els portlets de la vista per defecte d'un contenidor. Si voleu administrar els portlets del contenidor en si, ${go_here}.
es: Está administrando los portlets de la vista predeterminada de un contenedor. Si desea administrar los portlets del contenedor en sí, ${go_here}.

# label_manage_portlets_default_view_container_go_here
source: go here
ca: vine aquí
es: ven aquí

source: Manage portlets above content
ca: Administrar portlets sobre el contingut
es: Administrar portlets sobre el contenido

# manage_portlets_above_link
source: Add, edit or remove a portlet above the content
ca: Afegiu, editeu o elimineu un portlet sobre el contingut
es: Agregue, edite o elimine un portlet sobre el contenido

source: Manage portlets below content
ca: Administrar portlets sota del contingut
es: Administrar portlets debajo del contenido

# manage_portlets_below_link
source: Add, edit or remove a portlet below the content
ca: Afegiu, editeu o elimineu un portlet sota del contingut
es: Agregue, edite o elimine un portlet debajo del contenido

# manage_portlets_below_title_link
source: Add, edit or remove a portlet below the content title
ca: Afegiu, editeu o elimineu un portlet sota el títol del contingut
es: Agregue, edite o elimine un portlet debajo del título del contenido

# message_warning_below_content_area_dd
source: If you add portlets here, they will only appear on this item. If instead you want portlets to appear on all items in this folder, ${manage-portletsbelowcontent_link}
ca: Si afegiu portlets aquí, només apareixeran en aquest article. Si, per contra, desitja que apareguin els portlets en tots els elements d'aquesta carpeta, ${manage-portletsbelowcontent_link}
es: Si agrega portlets aquí, solo aparecerán en este artículo. Si, por el contrario, desea que aparezcan los portlets en todos los elementos de esta carpeta, ${manage-portletsbelowcontent_link}

# message_warning_below_content_area_dt
source: Is this really where you want to add portlets below the content?
ca: És això realment on voleu afegir portlets sota del contingut?
es: ¿Es esto realmente donde desea agregar portlets debajo del contenido?

# return_to_view
source: Return
ca: Retorna
es: Regresa

# title_legacy_portlets
source: Legacy portlets
ca: Portlets heretats
es: Portlets heredados

# title_manage_contenttype_portlets
source: ${contenttype_icon} Manage content type portlets for ${contenttype_name}
ca: ${contenttype_icon} Administrar portlets de tipus de contingut per a ${contenttype_name}
es: ${contenttype_icon} Administrar portlets de tipo de contenido para ${contenttype_name}

# title_manage_contextual_portlets
source: Manage portlets for ${context_title}
ca: Administrar portlets per a ${context_title}
es: Administrar portlets para ${context_title}
