Repository: UPCnet/ushare.core
Catalog: src/ushare/core/locales/*/LC_MESSAGES/z3c.form.po
Languages: ca

source: Add
ca: Addicionar

source: Remove selected
ca: Elimina seleccionats

source: No value
ca: Sense valor

source: Select a value ...
ca: Seleccioneu un valor ...

source: The entered value is not a valid integer literal.
ca: El valor introduït no és un nombre enter vàlid.

source: The entered value is not a valid decimal literal.
ca: El valor introduït no és un nombre decimal vàlid.

source: Bytes data are not a file object
ca: Les dades no conformen un arxiu

source: The system could not process the given value.
ca: El sistema no ha pogut processar el valor donat.

source: <span class="required">*</span>&ndash; required
ca: <span class="required">*</span>&ndash; obligatori

source: There were some errors.
ca: Hi va haver alguns errors.

source: Data successfully updated.
ca: Dades actualitzades amb èxit.

source: No changes were applied.
ca: Els canvis no es van aplicar.

source: Apply
ca: Aplicar

source: The context in which the data are validated.
ca: El context en el qual les dades són validats.

source: The widget that the view is on
ca: El widget en el qual la vista està habilitada

source: Error the view is for.
ca: Error per al qual s'utilitzarà la vista.

source: Title
ca: Títol

source: The name of the field within the form.
ca: El nom del camp dins el formulari.

source: Schema Field
ca: Camp de l'esquema

source: The schema field that is to be rendered.
ca: El camp de l'esquema que es renderitzarà.

source: The prefix of the field used to avoid name clashes.
ca: El prefix del camp utilitzat per evitar conflictes en el nom.

source: The mode in which to render the widget for the field.
ca: La manera en el qual es renderitzarà el giny per al camp.

source: Interface
ca: Interfície

source: The interface from which the field is coming.
ca: La interfície de la qual ve el camp.

source: Ignore Context
ca: Ignora el context

source: A flag, when set, forces the widget not to look at the context for a value.
ca: Una marca que, quan està habilitada, força a l'giny a no considerar el context per a un valor.

source: Widget Factory
ca: Fàbrica de widgets

source: The widget factory.
ca: La fàbrica de widgets.

source: Show default value
ca: Mostra el valor predeterminat

source: A flag, when set, makes the widget to displayfield|adapter provided default values.
ca: Una marca que, quan està habilitada, força a l'giny a no considerar el context per a un valor.

source: True-value Label
ca: Text per al valor veritable

source: The label for a true value of the Bool field.
ca: El text per al valor veritable d'un camp Bool.

source: False-value Label
ca: Text per al valor fals

source: The label for a false value of the Bool field.
ca: El text per al valor fals d'un camp Bool.

source: Name
ca: Nom

source: The name the widget is known under.
ca: El nom sota el qual es coneix el widget.

source: Label
ca: Etiqueta

source: The widget label. Label may be translated for the request. The attribute may be implemented as either a read-write or read-only property, depending on the requirements for a specific implementation.
ca: L'etiqueta del widget. Aquest text es pot traduir per a la petició. L'atribut pot ser implementat tant com una propietat de lectura-escriptura com de només-lectura, en dependència dels requeriments per a una implementació específica.

source: A widget mode.
ca: Un mode de widget.

source: Required
ca: Obligatori

source: If true the widget should be displayed as required input.
ca: En cas de ser veritable, el widget es mostrarà com un camp obligatori.

source: If an error occurred during any step, the error view stored here.
ca: En cas d'ocórrer un error en qualsevol pas, la vista de l'error s'emmagatzema aquí.

source: Value
ca: Valor

source: The value that the widget represents.
ca: El valor que el widget representa.

source: Ignore Request
ca: Ignora la petició

source: A flag, when set, forces the widget not to look at the request for a value.
ca: Una marca que, quan està habilitada, força a l'giny a no considerar la petició per a un valor.

source: Set errors
ca: Definir errors

source: A flag, when set, the widget sets error messages on calling extract().
ca: Una marca que, quan està habilitada, força a l'giny a establir els missatges d'error cridant al mètode extract().

source: Ignore Required validation
ca: Ignora la petició

source: If set then required fields will pass validation regardless whether they're filled in or not
ca: Si s'estableix, els camps obligatoris passaran la validació independentment de si estan o no

source: NO_VALUE Token
ca: Token per SENSE_VALOR

source: The token to be used, if no value has been selected.
ca: El testimoni que serà utilitzat quan no es va seleccionar cap valor.

source: Terms
ca: Termes

source: A component that provides the options for selection.
ca: Un component que proveeix les opcions per a la selecció.

source: A flag, when set, enables a choice explicitely requesting the user to choose a value.
ca: Una marca que, quan està habilitada, obliga l'usuari a triar un valor de manera explícita.

source: Items
ca: Ítems

source: A collection of dictionaries containing all pieces of information for rendering. The following keys must be in each dictionary: id, value, content, selected
ca: Una col·lecció de diccionaris contenint totes les peces d'informació per a renderitzar. Les següents claus han d'estar en cada diccionari: id, value, content, selected

source: No-Value Message
ca: Missatge quan no hi ha valor

source: A human-readable text that is displayed to refer the missing value.
ca: Un text llegible que es mostra per indicar que no es va introduir un valor.

source: Prompt Message
ca: Missatge per al prompt

source: The prefix of the widgets.
ca: Prefix per als widgets.

source: The collection of errors that occured during validation.
ca: La col·lecció d'errors que van ocórrer durant una validació.

source: If set the context is ignored to retrieve a value.
ca: Si està marcat el context s'ignora en obtenir un valor.

source: If set the request is ignored to retrieve a value.
ca: Si està marcat la petició s'ignora en obtenir un valor.

source: Ignore Readonly
ca: Ignora només-lectura

source: If set then readonly fields will also be shown.
ca: Si està marcat els camps de només-lectura es mostren també.

source: Ignore Required validation on extract
ca: Ignora la validació obligatòria a l'extracte

source: If set then required fields will pass validation on extract regardless whether they're filled in or not
ca: Si s'estableix, els camps obligatoris passaran la validació a l'extracte, independentment de si estan o no

source: Has required fields
ca: Té camps obligatoris

source: A flag set when at least one field is marked as required
ca: Una marca que, quan està habilitada, indica que almenys un camp està marcat com obligatori

source: A flag, when set, the contained widgets set error messages on calling extract().
ca: Una marca que, quan està habilitada, obliga els widgets a establir els missatges d'error trucant al mètode extract().

source: Field
ca: Camp

source: The schema field which the widget is representing.
ca: El camp de l'esquema al qual representa el widget.

source: The object name.
ca: El nom de l'objecte.

source: The action title.
ca: El títol de l'acció.

source: Action
ca: Acció

source: The action for which the event is created.
ca: L'acció per la qual va ser creat l'esdeveniment.

source: The error that occurred during the action.
ca: L'error que va ocórrer durant l'acció.

source: Access Key
ca: Tecla d'accés

source: The key when pressed causes the button to be pressed.
ca: La tecla que, en pressionar-la, fa que el botó es pressioni.

source: Action Factory
ca: Fàbrica d'accions

source: The action factory.
ca: La fàbrica d'accions

source: Image Path
ca: Ruta de la imatge

source: A relative image path to the root of the resources.
ca: Una ruta relativa d'una imatge a l'arrel dels recursos.

source: A list of action handlers defined on the form.
ca: Una llista de handlers d'accions definida en el formulari.

source: Actions
ca: Accions

source: A list of actions defined on the form
ca: Una llista d'accions definida en el formulari

source: Refresh actions
ca: Actualitzar accions

source: A flag, when set, causes form actions to be updated again after their execution.
ca: Una marca que, quan està habilitada, provoca que les accions del formulari s'actualitzin després de la seva execució.

source: The context in which the widget is displayed.
ca: El context en el qual es mostrarà el widget.

source: The mode in which to render the widgets.
ca: La manera de renderització dels widgets.

source: A widget manager containing the widgets to be used in the form.
ca: Un administrador de widgets que conté els ginys que s'utilitzaran en el formulari.

source: A human readable text describing the form that can be used in the UI.
ca: Un text llegible que descriu els formularis que es poden utilitzar en el IU.

source: Label required
ca: Etiqueta obligatoria

source: A human readable text describing the form that can be used in the UI for rendering a required info legend.
ca: Un text llegible descrivint el formulari que pot ser usat en el IU per renderitzar la llegenda d'una informació requerida.

source: The prefix of the form used to uniquely identify it.
ca: El prefix del formulari utilitzat per identificar-lo de manera única.

source: Status
ca: Estat

source: The status message of the form.
ca: El missatge d'estat d'un formulari.

source: The action defines the URI to which the form data are sent.
ca: L'acció que defineix l'URI al qual s'enviarà la informació del formulari.

source: The name of the form used to identify it.
ca: El nom del formulari usat per identificar-lo.

source: The id of the form used to identify it.
ca: L'identificador del formulari usat per identificar-lo.

source: Method
ca: Mètode

source: The HTTP method used to submit the form.
ca: El mètode HTTP utilitzat per a l'enviament del formulari.

source: Encoding Type
ca: Tipus de codificació

source: The data encoding used to submit the data safely.
ca: La codificació de dades usada per enviar la informació de manera segura.

source: Accepted Character Sets
ca: Conjunts de caràcters acceptats

source: This is a list of character sets the server accepts. By default this is unknown.
ca: Aquesta és una llista de conjunts de caràcters que el servidor accepta. Per defecte, això és desconegut.

source: Accepted Content Types
ca: Tipus de contingut acceptats

source: This is a list of content types the server can safely handle.
ca: Aquesta és una llista de tipus de contingut que el servidor pot manipular de forma segura.

source: Fields
ca: Camps

source: A field manager describing the fields to be used for the form.
ca: Un administrador de camps descrivint els camps que seran usats en el formulari.

source: Content providers
ca: Proveïdors de contingut

source: A manager describing the content providers to be used for the form.
ca: Un administrador descrivint els proveïdors de contingut que seran usats en el formulari.

source: Buttons
ca: Botons

source: A button manager describing the buttons to be used for the form.
ca: Un administrador de botons descrivint els botons que seran usats en el formulari.

source: The widget for which the event was created.
ca: El widget per al qual l'esdeveniment va ser creat.

source: Missing: ${value}
ca: Falta: ${value}

source: yes
ca: sí

source: Missing filename extension.
ca: Falta l'extensió de l'arxiu.

source: Layout template.
ca: Plantilla de disseny.

source: Refers to a file containing a page template (should end in extension ``.pt`` or ``.html``).
ca: Es refereix a un fitxer contenint una plantilla (ha de finalitzar en una extensió ``.pt`` o ``.html``).

source: The mode of the template.
ca: La manera de la plantilla

source: The mode is used to define input and display templates
ca: El mode és usat per definir les plantilles d'entrada i visualització

source: View
ca: Vista

source: The view for which the template should be available
ca: La vista per a la qual la plantilla ha d'estar disponible

source: Layer
ca: Capa

source: The layer for which the template should be available
ca: La capa per a la qual la plantilla ha d'estar disponible

source: The field for which the template should be available
ca: El camp per al qual la plantilla ha d'estar disponible

source: The widget for which the template should be available
ca: El widget per al qual la plantilla ha d'estar disponible

source: Content Type
ca: Tipus de contingut

source: The content type identifies the type of data.
ca: El tipus de contingut identifica el tipus de dades.

source: Schema
ca: Esquema

source: The schema of the field for which the template should be available
ca: L'esquema del camp per al qual la plantilla ha d'estar disponible
